Revit 2026 API

# ViewDetailLevel Enumeration

---

Detail level of the view

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ViewDetailLevel
```
```vb
Public Enumeration ViewDetailLevel
```
```cpp
public enum class ViewDetailLevel
```
```fsharp
type ViewDetailLevel
```

| Member name | Value | Description |
| --- | --- | --- |
| Coarse | 1 | Coarse |
| Fine | 3 | Fine |
| Medium | 2 | Medium |
| Undefined | 0 | View does not use Detail Level |

#### Reference

Autodesk.Revit.DB Namespace